<?php

use Illuminate\Database\Seeder;
use App\OurMission;
use App\News;

// composer require laracasts/testdummy
//use Laracasts\TestDummy\Factory as TestDummy;

class HomepageTableSeeder extends Seeder
{


    public function run()
    {
        // TestDummy::times(20)->create('App\Post');
//        User::create(['name' => 'polash','email' => 'polash@gmail.com','password' => bcrypt('1')]);
        $description = '‘দীপ শিখা হাতে স্বপ্নের পথে’ এই প্রতিপাদ্যকে সামনে রেখে ২০০৭ সালে যাত্রা শুরু করে ‘স্বপ্নোত্থান’। দেশের উত্তরপূর্বের এ জনপদে প্রযুক্তি বিদ্যার আতুড়ঘর নামে পরিচিত ডিজিটাল শিক্ষাঙ্গন শাহজালাল বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ের কিছু উদ্যমী তরুণের অক্লান্ত পরিশ্রমে গড়ে ওঠে এ সেচ্ছাসেবী সংগঠনটি। <br>
						দীর্ঘ এ পথচলায় এ সংগঠনের হাল ধরেছেন অনেকেই। ‘শফিকুর রহমান’ নামটি এর মাঝে একটু আলাদা করেই উচ্চারিত হয়। তাঁরই নেতৃত্বে সমাজের সুবিধাবঞ্চিত মানুষের শিক্ষা ও সেবার মানসে স্বপ্নবান কিছু তরুনের নিরলস প্রচেষ্ঠার ফসল আজকের স্বপ্নকামী সংগঠন ‘স্বপ্নোত্থান’। অবহেলিত জনগোষ্ঠীর সেবা নিশ্চিত করতে স্বপ্নোত্থানিয়ানরা সেই থেকে দেখিয়ে চলেছে স্বপ্ন। ব্রত থেকেছে এক একটি স্বপ্নের বাস্তবায়নে। সংগঠনটি সুবিধাবঞ্চিত মানুষের স্বপ্নের প্রতিবন্ধকতা কাটাতে বদ্ধপরিকর। <br>
						অর্থাভাবে পরিবারহীন বেড়ে ওঠা শিশুটিকে জীবনের সঠিক রাস্তা দেখাতে দৃঢ় প্রতিজ্ঞ ‘স্বপ্নোত্থান’। পরিবেশ পরিস্থিতির শিকার হয়ে ভুল পথে পা বাড়ানো শিশুটির পাশে স্বপ্নোত্থানের সেচ্ছাসেবীরা দাঁড়াই ভাইয়া-আপু হয়ে। মা-বাবার মমতা না পাওয়া শিশুটির পাশে থাকে অভিভাবকের ছায়া হয়ে। এর সবকিছু সম্ভব হয় স্বপ্নোত্থানের স্বপ্নকামী অন্তঃপ্রাণ স্বেচ্ছাসেবীদেও জন্য। পরম ভালবাসা, মমতা আর স্নেহের পরশ দিয়ে বাঁচিয়ে রাখে এক একটি শিশুর স্বপ্ন। <br>
						১.স্বপ্নোত্থান মূলত কাজ করে শিক্ষা নিয়ে। এ কাজের অংশ হিসেবে স্বপ্নোত্থানের স্বেচ্ছাসেবীরা কাজ করে কর্মজীবি শিশুদের স্কুল ভোলানন্দ নৈশ বিদ্যালয়ে। এখানের শিক্ষার্থীদের কম-বেশ সবাই দিনে কাজ করে। রাতের সময়টা বেছে নেয় শিক্ষার কাজে। এই সময়ে সারাদিন ক্লাস পরীক্ষার ধকল পাশকাটিয়ে স্বপ্নোত্থানের স্বেচ্ছাসেবীরা শিক্ষা সেবায় মন দেয়। সারাদিন কাজে থাকা ক্লান্ত শিক্ষার্থীদের ক্লাসে স্বপ্নোত্থানের স্বেচ্ছাসেবীরা তখন নিজেদের শিক্ষার্থী পরিচয় ভুলে গিয়ে স্বপ্ন সারথী হিসেবে নির্দেশনা দিয়ে থাকে। ভোলানন্দ নৈশ বিদ্যালয়ের শিক্ষার্থীরা সমাজের বৈষম্যপূর্ণ ব্যবস্থাকে বৃদ্ধাঙ্গুলি দেখিয়ে অদম্য আগ্রহে পড়াশুনা চালিয়ে যায়। নৈশ বিদ্যালয়ের সম্মানিত শিক্ষকদের পাশাপাশি স্বপ্নোত্থানের স্বেচ্ছাসেবীরা এখানে সপ্তাহে তিনদিন ৫ম থেকে ১০ম শ্রেনী পর্যন্ত ক্লাস নিয়ে থাকে। পড়ানোর পাশাপাশি দিয়ে থাকে মূল্যবোধের শিক্ষা। অনুপ্রাণিত করে পৃথিবীকে জয় করার বিভিন্ন গল্প শুনিয়ে। পাঠ্যক্রমে তাদের অংশগ্রহনের ফলেই এ বিদ্যালয় থেকে পাশ করা শিক্ষার্থীরা পরে বিশ্ববিদ্যালয় পড়ুয়াদের কাতারে নাম লেখায়। তেমনি সহ-শিক্ষা কার্যক্রমে তাদের অংশগ্রহনও উল্লেখযোগ্য। প্রতিবছরের বিভিন্ন জাতীয় দিবস এদের সাথে উদযাপন করে স্বপ্নোত্থানের স্বেচ্ছাসেবীরা। এসব দিনে ক্রীড়া প্রতিযোগীতার আয়োজন করা হয় স্বপ্নোত্থানের পক্ষ থেকে। <br>
						২. স্বপ্নোত্থানের আরেকটি বিশেষ কর্মের ক্ষেত্র ‘ছোটমণি নিবাস’। পরিবারহীন ০-৬ বছর বয়সী এক-ঝাঁক প্রজাপতির মিলনমেলা সমাজসেবা অধিদপ্তরের এই এতিমখানাটিতে। স্বপ্নোত্থানের স্বেচ্ছাসেবীরা চেষ্টা করে তাদের আপনজন হয়ে কিছুটা আদর ভালোবাসা দিতে, চেষ্টা করে পরম মমতায় জড়িয়ে নিতে। নাচ-গান, খেলাধুলা, কবিতার মাধ্যমে কিছুক্ষন চেষ্টা করে তাদের মাতিয়ে রাখতে। তারাও পরম ভালোবাসায় স্বপ্নোত্থানের স্বেচ্ছাসেবীদের বুকে টেনে নেয়; নিজের আপন কেউ মনে করে। কোলে উঠলে তো নামতেই চায় না। যতক্ষণ স্বপ্নোত্থানের স্বেচ্ছাসেবীরা সেখানে থাকে, ততক্ষণই চেষ্টা করে এইসব বাচ্চাদের বুঝাতে যে তারা কখনোই একা নয়। এছাড়া প্রতিবছর ঈদের আগে ছোটমণিতে মেহেদী উৎসবের আয়োজন করা হয়। নতুন নতুন উপহারের পাশাপাশি ছোটমণিদের হাত রাঙিয়ে দেয় স্বপ্নোত্থানের স্বেচ্ছাসেবীরা। ঈদের আগে নতুন উপহার ও মেহেদীতে এইসব বাচ্চাদের চোখে-মুখের আনন্দের ঝিলিক দেখাটা আসলেই অসাধারণ। <br>
						৩. পুনর্বাসন কাজেও স্বপ্নোত্থান রেখেছে অনন্য ভূমিকা। ঢাকায় কুড়িয়ে পাওয়া শিশু ‘শব্দ’ এর পূনর্বাসনে কিংবা দশম শ্রেনীর ‘জোনাকি’র শিক্ষার ব্যবস্থা করে দেয়া এর মধ্যে অন্যতম। <br>
						৪. স্বপ্নোত্থানের নিয়মিত কার্যক্রমের মধ্যে আরেকটি হচ্ছে সিলেটসহ দেশের বিভিন্ন স্থানে রক্তদাতা নিবন্ধন এবং রক্তদান কার্যক্রম পরিচালনা করা। প্রতিমাসে স্বেচ্ছাসেবীরা বিভিন্ন জায়গায় রক্ত দান করে। প্রয়োজনে দ্রুত রক্ত পাওয়ার উদ্দেশ্যে স্বপ্নোত্থান এর পক্ষ থেকে ‘স্বেচ্ছা’ নামক একটি ইন্টারনেটভিত্তিক অনলাইন ব্লাড ডোনার আর্কাইভও করা হয়েছে। <br>
						৫. প্রতিবছর শীতে শীতার্ত মানুষের পাশে দাড়ায় ‘স্বপ্নোত্থান’। বিভিন্ন হল মেসের পাশাপাশি আশেপাশের আবাসিক এলাকা থেকে পুরাতন শীতবস্ত্র, আর্থিক সাহায্য সংগ্রহ করে তা পরবর্তীতে বাছাই করে সাথে নতুন কিছু যোগ করে শীতার্ত মানুষের মাঝে বিতরণ করা হয়। <br>
						৬. ঈদ মানে আনন্দ, ঈদ মানে খুশি। আর ঈদের খুশি থেকে যাতে একটি শিশুও বঞ্চিত না হয় সে লক্ষ্যে স্বপ্নোত্থান ঈদবস্ত্র বিতরণ কার্যক্রম পরিচালনা করে থাকে। ক্যাম্পাসের শিক্ষক এবং সাবেক ও বর্তমান শিক্ষার্থীদের কাছ থেকে আর্থিক অনুদান নিয়ে বিশ্ববিদ্যালয় ও আশেপাশের এলাকাসহ নগরীর বিভিন্ন এলাকায় সহস্রাধিক পরিবারের মাঝে ঈদবস্ত্র বিতরণ করে থাকে ‘স্বপ্নোত্থান’। <br>
						৭. পবিত্র মাহে রমজানে ভোলানন্দ নৈশ বিদ্যালয়ে এবং বিশ্ববিদ্যালয় ক্যাম্পাসে সুবিধাবঞ্চিত শিশুদের নিয়ে ইফতার মাহফিলের আয়োজন করে থাকে ‘স্বপ্নোত্থান’। <br>
						অসহায়, দরিদ্র ও চিকিৎসা ব্যয়ভার বহনে অক্ষম, দুরারোগ্য রোগে আক্রান্ত ব্যক্তির চিকিৎসার জন্য ক্ষেত্র বিশেষে স্বপ্নোত্থান বিভিন্ন তহবিল সংগ্রহ করে থাকে। এছাড়া দেশের যেকোনো সংকট, প্রাকৃতিক দুর্যোগের সময়ও অর্থ সংগ্রহের ব্যবস্থা করে স্বপ্নোত্থান। আর এ তহবিল সংগ্রহের কাজে বিভিন্ন সময় ইনডোর গেমস, বইমেলা কিংবা চ্যারিটি ফিল্ম ফেস্টিভালেরও আয়োজন করে স্বপ্নোত্থান । <br>
						এছাড়া বিভিন্ন জাতীয় দিবসগুলো পালন করে থাকে ‘স্বপ্নোত্থান’। জাতীয় চেতনায় উদ্বুদ্ধ হয়ে দেশমাতৃকার প্রতি সম্মান জানিয়ে দিবসগুলোতে কুইজ প্রতিযোগীতা, ক্রীড়া প্রতিযোগীতা ও সাংস্কৃতিক অনুষ্ঠানের আয়োজনও করে ‘স্বপ্নোত্থান’। <br>
						বিশ্ববিদ্যালয়ের একঘেয়েমিতা ও স্বেচ্ছাসেবীমূলক কাজের মধ্যে সমন্বয়, নতুনত্ব ও সজীবতা নিয়ে আসতে স্বপ্নোত্থান নিজেদের সদস্য ও শুভাকাঙ্খীদের নিয়ে করে থাকে বার্ষিক বনভোজন ও বারবিকিউ উৎসব। অন্যদিকে সাংস্কৃতিক সন্ধ্যা, ব্যাডমিন্টন টুর্নামেন্ট, রোড পেইন্টিং, ফল উৎসবের আয়োজন করে থাকে। তদুপরি সাম্প্রতিক সময়ে বিভিন্ন স্বেচ্ছাসেবী সংগঠনের সাথে একযোগে সচেতনতামুলক বিভিন্ন অনুষ্ঠান যেমন মাদকদ্রব্য নিরোধ কেন্দ্রের সাথে মাদকবিরোধী সেমিনার, ইউনাইটেড নেশনস ভলান্টিয়ার (ইউএনভি) এর সাথে স্বেচ্ছাসেবীতার উপর সেমিনার, কিংবা ডেন্টাল কেয়ার সিলেট এর সাথে যৌথভাবে ফ্রি ডেন্টাল চেকআপ এন্ড ওরাল হেলথ এ্যাওয়ারনেস শীর্ষক কাজ কওে চলেছে ‘স্বপ্নোত্থান’। <br>
						‘স্বপ্নোত্থান’ স্বপ্ন দেখে মানবিক বাংলাদেশে বির্নিমানের। ফলশ্রতিতে প্রতিদিনের সূর্যাস্তের সাথে সাথে অপেক্ষা করে আগামী দিনের নতুন সূর্যোদয়ের।';
        
        $newses = [
		['title' => 'Swapnotthan observes establishment day at SUST',
         'description' => 'Swapnotthan a voluntary organisation, observes its 7th establishment anniversary at Shahjalal University of Science and Technology (SUST) on Monday, 1st August,2016.'],
        ['title' => 'শাবির স্বেচ্ছাসেবী সংগঠন স্বপ্নোত্থানের শীতবস্ত্র বিতরণ সম্পন্ন',
         'description' => 'শাহজালাল বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ের স্বেচ্ছাসেবী সংগঠন স্বপ্নোত্থান প্রতিবছরের ন্যায় এবার ও শীতবস্ত্র বিতরণ কর্মসূচী সম্পন্ন করেছে। বিগত ২৭ ডিসেম্বর, ২০১৭ মৌলভীবাজার এর শমশেরনগর চাবাগান এর দরিদ্র শ্রমিকদের মাঝে শীতের কাপড় বিতরণ করে সংগঠনটি।'],
        ['title' => 'স্বপ্নোত্থানের নবীনবরণ ও সাংস্কৃতিক সন্ধ্যা পালিত',
         'description' => 'গত ৮ই এপ্রিল শাবিপ্রবির অনন্য স্বেচ্ছাসেবী সংগঠন স্বপ্নোত্থান বাৎসরিক নবীনবরণ ও সাংস্কৃতিক সন্ধ্যা পালন করেছে। উক্ত অনুষ্ঠানে স্বপ্নোত্থানের ৮ম কার্যনির্বাহী কমিটি ও ঘোষণা করা হয়। ']
        ];

        OurMission::create(['description' => $description]);
        foreach ($newses as $news) {
        	News::create($news);
        }
    }
}
